Revit 2027 API
BuiltInFailures.WorksharingFailures.SeriousElementReferenceCorruption Property
 Element references are seriously corrupt.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SeriousElementReferenceCorruption { get; }
Public Shared ReadOnly Property SeriousElementReferenceCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SeriousElementReferenceCorruption {
	FailureDefinitionId^ get ();
}
static member SeriousElementReferenceCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WorksharingFailures Class
Autodesk.Revit.DB Namespace